app/Controllers/Admins/AdminsController.php

SELECT COUNT(*) AS `numrows`
FROM `properties`
SELECT COUNT(*) AS `numrows`
FROM `admins`
---
    public function index() {


        $session = session();

        $propsCount = $this->db->table('properties')
         ->countAllResults();

        $adminsCount = $this->db->table('admins')
         ->countAllResults();

         $homeTypesCount = $this->db->table('admins')
         ->countAllResults();

SELECT *
FROM `admins`
---
    public function displayAdmins() {


        $session = session();

        $admins = new Admin();

        $allAdmins = $admins->findAll();

INSERT INTO `admins` (`email`, `name`, `password`) VALUES ('moha2343@gmail.com', 'moha2343', '$2y$10$msGvcQU0oIzbmj7K6OBevefbKYdU.SkqURiv3Pki7zRIgvSylgD0.')
---
            ];


            $admins->save($data);

SELECT *
FROM `hometypes`
---
    public function displayHomeTypes() {


        $session = session();

        $homeTypes = new HomeType();

        $allHomeTypes = $homeTypes->findAll();

SELECT *
FROM `properties`
---
    public function displayProps() {


        $session = session();

        $props = new Property();

        $allProps = $props->findAll();

SELECT *
FROM `requests`
---
    public function displayRequests() {


        $session = session();

        $requests = new Request();

        $allRequests = $requests->findAll();